Revit 2027 API
BuiltInFailures.GenericMEPFailures.MaxWidthAndHeightReached Property
 Maximum width and height reached during sizing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MaxWidthAndHeightReached { get; }
Public Shared ReadOnly Property MaxWidthAndHeightReached As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MaxWidthAndHeightReached {
	FailureDefinitionId^ get ();
}
static member MaxWidthAndHeightReached : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace